; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_1)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 link6 link7 link8 link9 link10 link11 link12 link13 - link
    angle0 angle45 angle90 angle135 angle180 angle225 angle270 angle315 - angle)
(:init
    (AngleOrd angle0 angle45)
    (AngleOrd angle45 angle90)
    (AngleOrd angle90 angle135)
    (AngleOrd angle135 angle180)
    (AngleOrd angle180 angle225)
    (AngleOrd angle225 angle270)
    (AngleOrd angle270 angle315)
    (AngleOrd angle315 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)
    (IsChildOf link6 link5)
    (IsChildOf link7 link6)
    (IsChildOf link8 link7)
    (IsChildOf link9 link8)
    (IsChildOf link10 link9)
    (IsChildOf link11 link10)
    (IsChildOf link12 link11)
    (IsChildOf link13 link12)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)
    (Affected link6 link1)
    (Affected link6 link2)
    (Affected link6 link3)
    (Affected link6 link4)
    (Affected link6 link5)
    (Affected link7 link1)
    (Affected link7 link2)
    (Affected link7 link3)
    (Affected link7 link4)
    (Affected link7 link5)
    (Affected link7 link6)
    (Affected link8 link1)
    (Affected link8 link2)
    (Affected link8 link3)
    (Affected link8 link4)
    (Affected link8 link5)
    (Affected link8 link6)
    (Affected link8 link7)
    (Affected link9 link1)
    (Affected link9 link2)
    (Affected link9 link3)
    (Affected link9 link4)
    (Affected link9 link5)
    (Affected link9 link6)
    (Affected link9 link7)
    (Affected link9 link8)
    (Affected link10 link1)
    (Affected link10 link2)
    (Affected link10 link3)
    (Affected link10 link4)
    (Affected link10 link5)
    (Affected link10 link6)
    (Affected link10 link7)
    (Affected link10 link8)
    (Affected link10 link9)
    (Affected link11 link1)
    (Affected link11 link2)
    (Affected link11 link3)
    (Affected link11 link4)
    (Affected link11 link5)
    (Affected link11 link6)
    (Affected link11 link7)
    (Affected link11 link8)
    (Affected link11 link9)
    (Affected link11 link10)
    (Affected link12 link1)
    (Affected link12 link2)
    (Affected link12 link3)
    (Affected link12 link4)
    (Affected link12 link5)
    (Affected link12 link6)
    (Affected link12 link7)
    (Affected link12 link8)
    (Affected link12 link9)
    (Affected link12 link10)
    (Affected link12 link11)
    (Affected link13 link1)
    (Affected link13 link2)
    (Affected link13 link3)
    (Affected link13 link4)
    (Affected link13 link5)
    (Affected link13 link6)
    (Affected link13 link7)
    (Affected link13 link8)
    (Affected link13 link9)
    (Affected link13 link10)
    (Affected link13 link11)
    (Affected link13 link12)

    (HasAngle angle315 link1)
    (HasAngle angle135 link2)
    (HasAngle angle135 link3)
    (HasAngle angle135 link4)
    (HasAngle angle270 link5)
    (HasAngle angle270 link6)
    (HasAngle angle0 link7)
    (HasAngle angle180 link8)
    (HasAngle angle180 link9)
    (HasAngle angle0 link10)
    (HasAngle angle270 link11)
    (HasAngle angle90 link12)
    (HasAngle angle45 link13)
)
(:goal
(and
    (HasAngle angle135 link1)
    (HasAngle angle270 link2)
    (HasAngle angle0 link3)
    (HasAngle angle0 link4)
    (HasAngle angle0 link5)
    (HasAngle angle225 link6)
    (HasAngle angle225 link7)
    (HasAngle angle225 link8)
    (HasAngle angle180 link9)
    (HasAngle angle90 link10)
    (HasAngle angle180 link11)
    (HasAngle angle45 link12)
    (HasAngle angle45 link13)
    )
)
)

; plan
1. (decrease_angle link1 angle315 angle270)
   deleted: (hasangle angle315 link1) (hasangle angle135 link2) (hasangle angle135 link3) (hasangle angle135 link4) (hasangle angle270 link5) (hasangle angle270 link6) (hasangle angle0 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle0 link10) (hasangle angle270 link11) (hasangle angle90 link12) (hasangle angle45 link13)
   added: (hasangle angle270 link1) (hasangle angle90 link2) (hasangle angle90 link3) (hasangle angle90 link4) (hasangle angle225 link5) (hasangle angle225 link6) (hasangle angle315 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle315 link10) (hasangle angle225 link11) (hasangle angle45 link12) (hasangle angle0 link13)
   goals met: 2 of 13
2. (decrease_angle link1 angle270 angle225)
   deleted: (hasangle angle270 link1) (hasangle angle90 link2) (hasangle angle90 link3) (hasangle angle90 link4) (hasangle angle225 link5) (hasangle angle225 link6) (hasangle angle315 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle315 link10) (hasangle angle225 link11) (hasangle angle45 link12) (hasangle angle0 link13)
   added: (hasangle angle225 link1) (hasangle angle45 link2) (hasangle angle45 link3) (hasangle angle45 link4) (hasangle angle180 link5) (hasangle angle180 link6) (hasangle angle270 link7) (hasangle angle90 link8) (hasangle angle90 link9) (hasangle angle270 link10) (hasangle angle180 link11) (hasangle angle0 link12) (hasangle angle315 link13)
   goals met: 1 of 13
3. (increase_angle link5 angle180 angle225)
   deleted: (hasangle angle180 link5) (hasangle angle180 link6) (hasangle angle270 link7) (hasangle angle90 link8) (hasangle angle90 link9) (hasangle angle270 link10) (hasangle angle180 link11) (hasangle angle0 link12) (hasangle angle315 link13)
   added: (hasangle angle225 link5) (hasangle angle225 link6) (hasangle angle315 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle315 link10) (hasangle angle225 link11) (hasangle angle45 link12) (hasangle angle0 link13)
   goals met: 2 of 13
4. (decrease_angle link3 angle45 angle0)
   deleted: (hasangle angle45 link3) (hasangle angle45 link4) (hasangle angle225 link5) (hasangle angle225 link6) (hasangle angle315 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle315 link10) (hasangle angle225 link11) (hasangle angle45 link12) (hasangle angle0 link13)
   added: (hasangle angle0 link3) (hasangle angle0 link4) (hasangle angle180 link5) (hasangle angle180 link6) (hasangle angle270 link7) (hasangle angle90 link8) (hasangle angle90 link9) (hasangle angle270 link10) (hasangle angle180 link11) (hasangle angle0 link12) (hasangle angle315 link13)
   goals met: 3 of 13
5. (increase_angle link2 angle45 angle90)
   deleted: (hasangle angle45 link2) (hasangle angle0 link3) (hasangle angle0 link4) (hasangle angle180 link5) (hasangle angle180 link6) (hasangle angle270 link7) (hasangle angle90 link8) (hasangle angle90 link9) (hasangle angle270 link10) (hasangle angle180 link11) (hasangle angle0 link12) (hasangle angle315 link13)
   added: (hasangle angle90 link2) (hasangle angle45 link3) (hasangle angle45 link4) (hasangle angle225 link5) (hasangle angle225 link6) (hasangle angle315 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle315 link10) (hasangle angle225 link11) (hasangle angle45 link12) (hasangle angle0 link13)
   goals met: 2 of 13
6. (decrease_angle link1 angle225 angle180)
   deleted: (hasangle angle225 link1) (hasangle angle90 link2) (hasangle angle45 link3) (hasangle angle45 link4) (hasangle angle225 link5) (hasangle angle225 link6) (hasangle angle315 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle315 link10) (hasangle angle225 link11) (hasangle angle45 link12) (hasangle angle0 link13)
   added: (hasangle angle180 link1) (hasangle angle45 link2) (hasangle angle0 link3) (hasangle angle0 link4) (hasangle angle180 link5) (hasangle angle180 link6) (hasangle angle270 link7) (hasangle angle90 link8) (hasangle angle90 link9) (hasangle angle270 link10) (hasangle angle180 link11) (hasangle angle0 link12) (hasangle angle315 link13)
   goals met: 3 of 13
7. (increase_angle link5 angle180 angle225)
   deleted: (hasangle angle180 link5) (hasangle angle180 link6) (hasangle angle270 link7) (hasangle angle90 link8) (hasangle angle90 link9) (hasangle angle270 link10) (hasangle angle180 link11) (hasangle angle0 link12) (hasangle angle315 link13)
   added: (hasangle angle225 link5) (hasangle angle225 link6) (hasangle angle315 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle315 link10) (hasangle angle225 link11) (hasangle angle45 link12) (hasangle angle0 link13)
   goals met: 4 of 13
8. (increase_angle link10 angle315 angle0)
   deleted: (hasangle angle315 link10) (hasangle angle225 link11) (hasangle angle45 link12) (hasangle angle0 link13)
   added: (hasangle angle0 link10) (hasangle angle270 link11) (hasangle angle90 link12) (hasangle angle45 link13)
   goals met: 4 of 13
9. (decrease_angle link7 angle315 angle270)
   deleted: (hasangle angle315 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle0 link10) (hasangle angle270 link11) (hasangle angle90 link12) (hasangle angle45 link13)
   added: (hasangle angle270 link7) (hasangle angle90 link8) (hasangle angle90 link9) (hasangle angle315 link10) (hasangle angle225 link11) (hasangle angle45 link12) (hasangle angle0 link13)
   goals met: 4 of 13
10. (increase_angle link5 angle225 angle270)
   deleted: (hasangle angle225 link5) (hasangle angle225 link6) (hasangle angle270 link7) (hasangle angle90 link8) (hasangle angle90 link9) (hasangle angle315 link10) (hasangle angle225 link11) (hasangle angle45 link12) (hasangle angle0 link13)
   added: (hasangle angle270 link5) (hasangle angle270 link6) (hasangle angle315 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle0 link10) (hasangle angle270 link11) (hasangle angle90 link12) (hasangle angle45 link13)
   goals met: 3 of 13
11. (increase_angle link5 angle270 angle315)
   deleted: (hasangle angle270 link5) (hasangle angle270 link6) (hasangle angle315 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle0 link10) (hasangle angle270 link11) (hasangle angle90 link12) (hasangle angle45 link13)
   added: (hasangle angle315 link5) (hasangle angle315 link6) (hasangle angle0 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle315 link11) (hasangle angle135 link12) (hasangle angle90 link13)
   goals met: 3 of 13
12. (decrease_angle link1 angle180 angle135)
   deleted: (hasangle angle180 link1) (hasangle angle45 link2) (hasangle angle0 link3) (hasangle angle0 link4) (hasangle angle315 link5) (hasangle angle315 link6) (hasangle angle0 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle315 link11) (hasangle angle135 link12) (hasangle angle90 link13)
   added: (hasangle angle135 link1) (hasangle angle0 link2) (hasangle angle315 link3) (hasangle angle315 link4) (hasangle angle270 link5) (hasangle angle270 link6) (hasangle angle315 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle0 link10) (hasangle angle270 link11) (hasangle angle90 link12) (hasangle angle45 link13)
   goals met: 2 of 13
13. (increase_angle link3 angle315 angle0)
   deleted: (hasangle angle315 link3) (hasangle angle315 link4) (hasangle angle270 link5) (hasangle angle270 link6) (hasangle angle315 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle0 link10) (hasangle angle270 link11) (hasangle angle90 link12) (hasangle angle45 link13)
   added: (hasangle angle0 link3) (hasangle angle0 link4) (hasangle angle315 link5) (hasangle angle315 link6) (hasangle angle0 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle315 link11) (hasangle angle135 link12) (hasangle angle90 link13)
   goals met: 4 of 13
14. (decrease_angle link11 angle315 angle270)
   deleted: (hasangle angle315 link11) (hasangle angle135 link12) (hasangle angle90 link13)
   added: (hasangle angle270 link11) (hasangle angle90 link12) (hasangle angle45 link13)
   goals met: 5 of 13
15. (increase_angle link5 angle315 angle0)
   deleted: (hasangle angle315 link5) (hasangle angle315 link6) (hasangle angle0 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle270 link11) (hasangle angle90 link12) (hasangle angle45 link13)
   added: (hasangle angle0 link5) (hasangle angle0 link6) (hasangle angle45 link7) (hasangle angle225 link8) (hasangle angle225 link9) (hasangle angle90 link10) (hasangle angle315 link11) (hasangle angle135 link12) (hasangle angle90 link13)
   goals met: 6 of 13
16. (decrease_angle link7 angle45 angle0)
   deleted: (hasangle angle45 link7) (hasangle angle225 link8) (hasangle angle225 link9) (hasangle angle90 link10) (hasangle angle315 link11) (hasangle angle135 link12) (hasangle angle90 link13)
   added: (hasangle angle0 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle270 link11) (hasangle angle90 link12) (hasangle angle45 link13)
   goals met: 6 of 13
17. (decrease_angle link11 angle270 angle225)
   deleted: (hasangle angle270 link11) (hasangle angle90 link12) (hasangle angle45 link13)
   added: (hasangle angle225 link11) (hasangle angle45 link12) (hasangle angle0 link13)
   goals met: 6 of 13
18. (increase_angle link12 angle45 angle90)
   deleted: (hasangle angle45 link12) (hasangle angle0 link13)
   added: (hasangle angle90 link12) (hasangle angle45 link13)
   goals met: 6 of 13
19. (decrease_angle link11 angle225 angle180)
   deleted: (hasangle angle225 link11) (hasangle angle90 link12) (hasangle angle45 link13)
   added: (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle0 link13)
   goals met: 7 of 13
20. (increase_angle link8 angle180 angle225)
   deleted: (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle0 link13)
   added: (hasangle angle225 link8) (hasangle angle225 link9) (hasangle angle90 link10) (hasangle angle225 link11) (hasangle angle90 link12) (hasangle angle45 link13)
   goals met: 7 of 13
21. (decrease_angle link5 angle0 angle315)
   deleted: (hasangle angle0 link5) (hasangle angle0 link6) (hasangle angle0 link7) (hasangle angle225 link8) (hasangle angle225 link9) (hasangle angle90 link10) (hasangle angle225 link11) (hasangle angle90 link12) (hasangle angle45 link13)
   added: (hasangle angle315 link5) (hasangle angle315 link6) (hasangle angle315 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle0 link13)
   goals met: 6 of 13
22. (increase_angle link13 angle0 angle45)
   deleted: (hasangle angle0 link13)
   added: (hasangle angle45 link13)
   goals met: 7 of 13
23. (increase_angle link13 angle45 angle90)
   deleted: (hasangle angle45 link13)
   added: (hasangle angle90 link13)
   goals met: 6 of 13
24. (decrease_angle link11 angle180 angle135)
   deleted: (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle90 link13)
   added: (hasangle angle135 link11) (hasangle angle0 link12) (hasangle angle45 link13)
   goals met: 5 of 13
25. (increase_angle link8 angle180 angle225)
   deleted: (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle135 link11) (hasangle angle0 link12) (hasangle angle45 link13)
   added: (hasangle angle225 link8) (hasangle angle225 link9) (hasangle angle90 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle90 link13)
   goals met: 7 of 13
26. (decrease_angle link6 angle315 angle270)
   deleted: (hasangle angle315 link6) (hasangle angle315 link7) (hasangle angle225 link8) (hasangle angle225 link9) (hasangle angle90 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle90 link13)
   added: (hasangle angle270 link6) (hasangle angle270 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle135 link11) (hasangle angle0 link12) (hasangle angle45 link13)
   goals met: 5 of 13
27. (increase_angle link7 angle270 angle315)
   deleted: (hasangle angle270 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle135 link11) (hasangle angle0 link12) (hasangle angle45 link13)
   added: (hasangle angle315 link7) (hasangle angle225 link8) (hasangle angle225 link9) (hasangle angle90 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle90 link13)
   goals met: 7 of 13
28. (decrease_angle link13 angle90 angle45)
   deleted: (hasangle angle90 link13)
   added: (hasangle angle45 link13)
   goals met: 8 of 13
29. (increase_angle link11 angle180 angle225)
   deleted: (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle45 link13)
   added: (hasangle angle225 link11) (hasangle angle90 link12) (hasangle angle90 link13)
   goals met: 5 of 13
30. (decrease_angle link2 angle0 angle315)
   deleted: (hasangle angle0 link2) (hasangle angle0 link3) (hasangle angle0 link4) (hasangle angle315 link5) (hasangle angle270 link6) (hasangle angle315 link7) (hasangle angle225 link8) (hasangle angle225 link9) (hasangle angle90 link10) (hasangle angle225 link11) (hasangle angle90 link12) (hasangle angle90 link13)
   added: (hasangle angle315 link2) (hasangle angle315 link3) (hasangle angle315 link4) (hasangle angle270 link5) (hasangle angle225 link6) (hasangle angle270 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle45 link13)
   goals met: 6 of 13
31. (decrease_angle link2 angle315 angle270)
   deleted: (hasangle angle315 link2) (hasangle angle315 link3) (hasangle angle315 link4) (hasangle angle270 link5) (hasangle angle225 link6) (hasangle angle270 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle45 link13)
   added: (hasangle angle270 link2) (hasangle angle270 link3) (hasangle angle270 link4) (hasangle angle225 link5) (hasangle angle180 link6) (hasangle angle225 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle0 link10) (hasangle angle135 link11) (hasangle angle0 link12) (hasangle angle0 link13)
   goals met: 3 of 13
32. (increase_angle link4 angle270 angle315)
   deleted: (hasangle angle270 link4) (hasangle angle225 link5) (hasangle angle180 link6) (hasangle angle225 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle0 link10) (hasangle angle135 link11) (hasangle angle0 link12) (hasangle angle0 link13)
   added: (hasangle angle315 link4) (hasangle angle270 link5) (hasangle angle225 link6) (hasangle angle270 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle45 link13)
   goals met: 7 of 13
33. (increase_angle link3 angle270 angle315)
   deleted: (hasangle angle270 link3) (hasangle angle315 link4) (hasangle angle270 link5) (hasangle angle225 link6) (hasangle angle270 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle45 link13)
   added: (hasangle angle315 link3) (hasangle angle0 link4) (hasangle angle315 link5) (hasangle angle270 link6) (hasangle angle315 link7) (hasangle angle225 link8) (hasangle angle225 link9) (hasangle angle90 link10) (hasangle angle225 link11) (hasangle angle90 link12) (hasangle angle90 link13)
   goals met: 5 of 13
34. (decrease_angle link6 angle270 angle225)
   deleted: (hasangle angle270 link6) (hasangle angle315 link7) (hasangle angle225 link8) (hasangle angle225 link9) (hasangle angle90 link10) (hasangle angle225 link11) (hasangle angle90 link12) (hasangle angle90 link13)
   added: (hasangle angle225 link6) (hasangle angle270 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle45 link13)
   goals met: 8 of 13
35. (decrease_angle link7 angle270 angle225)
   deleted: (hasangle angle270 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle45 link13)
   added: (hasangle angle225 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle0 link10) (hasangle angle135 link11) (hasangle angle0 link12) (hasangle angle0 link13)
   goals met: 5 of 13
36. (increase_angle link8 angle135 angle180)
   deleted: (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle0 link10) (hasangle angle135 link11) (hasangle angle0 link12) (hasangle angle0 link13)
   added: (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle45 link13)
   goals met: 9 of 13
37. (increase_angle link3 angle315 angle0)
   deleted: (hasangle angle315 link3) (hasangle angle0 link4) (hasangle angle315 link5) (hasangle angle225 link6) (hasangle angle225 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle45 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle45 link13)
   added: (hasangle angle0 link3) (hasangle angle45 link4) (hasangle angle0 link5) (hasangle angle270 link6) (hasangle angle270 link7) (hasangle angle225 link8) (hasangle angle225 link9) (hasangle angle90 link10) (hasangle angle225 link11) (hasangle angle90 link12) (hasangle angle90 link13)
   goals met: 6 of 13
38. (increase_angle link10 angle90 angle135)
   deleted: (hasangle angle90 link10) (hasangle angle225 link11) (hasangle angle90 link12) (hasangle angle90 link13)
   added: (hasangle angle135 link10) (hasangle angle270 link11) (hasangle angle135 link12) (hasangle angle135 link13)
   goals met: 5 of 13
39. (decrease_angle link9 angle225 angle180)
   deleted: (hasangle angle225 link9) (hasangle angle135 link10) (hasangle angle270 link11) (hasangle angle135 link12) (hasangle angle135 link13)
   added: (hasangle angle180 link9) (hasangle angle90 link10) (hasangle angle225 link11) (hasangle angle90 link12) (hasangle angle90 link13)
   goals met: 7 of 13
40. (decrease_angle link11 angle225 angle180)
   deleted: (hasangle angle225 link11) (hasangle angle90 link12) (hasangle angle90 link13)
   added: (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle45 link13)
   goals met: 10 of 13
41. (increase_angle link8 angle225 angle270)
   deleted: (hasangle angle225 link8) (hasangle angle180 link9) (hasangle angle90 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle45 link13)
   added: (hasangle angle270 link8) (hasangle angle225 link9) (hasangle angle135 link10) (hasangle angle225 link11) (hasangle angle90 link12) (hasangle angle90 link13)
   goals met: 4 of 13
42. (decrease_angle link4 angle45 angle0)
   deleted: (hasangle angle45 link4) (hasangle angle0 link5) (hasangle angle270 link6) (hasangle angle270 link7) (hasangle angle270 link8) (hasangle angle225 link9) (hasangle angle135 link10) (hasangle angle225 link11) (hasangle angle90 link12) (hasangle angle90 link13)
   added: (hasangle angle0 link4) (hasangle angle315 link5) (hasangle angle225 link6) (hasangle angle225 link7) (hasangle angle225 link8) (hasangle angle180 link9) (hasangle angle90 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle45 link13)
   goals met: 12 of 13
43. (increase_angle link5 angle315 angle0)
   deleted: (hasangle angle315 link5) (hasangle angle225 link6) (hasangle angle225 link7) (hasangle angle225 link8) (hasangle angle180 link9) (hasangle angle90 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle45 link13)
   added: (hasangle angle0 link5) (hasangle angle270 link6) (hasangle angle270 link7) (hasangle angle270 link8) (hasangle angle225 link9) (hasangle angle135 link10) (hasangle angle225 link11) (hasangle angle90 link12) (hasangle angle90 link13)
   goals met: 5 of 13
44. (decrease_angle link6 angle270 angle225)
   deleted: (hasangle angle270 link6) (hasangle angle270 link7) (hasangle angle270 link8) (hasangle angle225 link9) (hasangle angle135 link10) (hasangle angle225 link11) (hasangle angle90 link12) (hasangle angle90 link13)
   added: (hasangle angle225 link6) (hasangle angle225 link7) (hasangle angle225 link8) (hasangle angle180 link9) (hasangle angle90 link10) (hasangle angle180 link11) (hasangle angle45 link12) (hasangle angle45 link13)
   goals met: 13 of 13
